IDEA Connection Link
ConnectionSrv.CalculationTimeLimit Property
 Get or set time limit for creating report (or CBFEM calculation)
 Namespace: IdeaRS.ConnectionService.Service
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public static int CalculationTimeLimit { get; set; }
Public Shared Property CalculationTimeLimit As Integer
	Get
	Set
public:
static property int CalculationTimeLimit {
	int get ();
	void set (int value);
}
Property Value
Type: Int32
See Also
Reference
ConnectionSrv Class
IdeaRS.ConnectionService.Service Namespace